hiroshica/SenseCAP_Indicator_ESP32/examples/indicator_basis/main/model/indicator_sensor.c
    if(p_data_day[DAY_MAX-1].valid){
        localtime_r( &(p_data_day[DAY_MAX-1].timestamp), &timeinfo);
        //history_hour = timeinfo.tm_hour;
        history_hour = (((timeinfo.tm_hour * 60) + timeinfo.tm_min) * 60) / SECOND_ADJUST;
    }

    if( cur_hour == history_hour) {
        return;
    }

    for( int i =0;  i < DAY_MAX-1; i++) {
        p_data_day[i].data = p_data_day[i+1].data;
        p_data_day[i].valid = p_data_day[i+1].valid;
        p_data_day[i].timestamp = p_data_day[i+1].timestamp;
        
        if( !p_data_day[i].valid) {
            p_data_day[i].timestamp = now - (DAY_MAX-1 -i) * SECOND_ADJUST;
        }
    }
    if( p_cur->per_hour_cnt >=1) {
        p_data_day[DAY_MAX-1].valid = true;
        p_data_day[DAY_MAX-1].data = p_cur->average;

        //clear present data 
        p_cur->per_hour_cnt = 0;
        p_cur->sum = 0.0;

    }  else {
        p_data_day[DAY_MAX-1].valid = false;
    }
    p_data_day[DAY_MAX-1].timestamp = now;

#if SENSOR_HISTORY_DATA_DEBUG
    for( int i =0;  i < DAY_MAX; i++) {
        if( p_data_day[i].valid) {
            ESP_LOGI(TAG, "index:%d, data:%.0f, time:%d", i, p_data_day[i].data, p_data_day[i].timestamp);
        }
    }
#endif

}
static void __sensor_history_data_week_insert(struct sensor_data_minmax p_data_week[],  struct sensor_present_data  *p_cur, time_t now)
{
    int history_mday =0;
    int cur_mday = 0;
    struct tm timeinfo;

    localtime_r( &now, &timeinfo);
    cur_mday = timeinfo.tm_mday;
    
    localtime_r( &(p_data_week[6].timestamp), &timeinfo);
    history_mday= timeinfo.tm_mday;

    if( history_mday ==  cur_mday) {
        return;
    }

    for( int i =0;  i < 6; i++) {
        p_data_week[i].max = p_data_week[i+1].max;
        p_data_week[i].min = p_data_week[i+1].min;
        p_data_week[i].timestamp = p_data_week[i+1].timestamp;
        p_data_week[i].valid = p_data_week[i+1].valid;

        if( !p_data_week[i].valid) {
            p_data_week[i].timestamp = now - (6 -i) * (SECOND_ADJUST * DAY_MAX);
        }
    }
    if( p_cur->per_day_cnt >=1) {
        p_data_week[6].valid = true;
        p_data_week[6].max = p_cur->day_max;
        p_data_week[6].min = p_cur->day_min;

        //clear present data
        p_cur->day_max = 0.0;
        p_cur->day_min = 0.0;
        p_cur->per_day_cnt = 0;
    }  else {
        p_data_week[6].valid = false;
    }
    p_data_week[6].timestamp = now;

#if SENSOR_HISTORY_DATA_DEBUG
    for( int i =0;  i < 7; i++) {
        if( p_data_week[i].valid) {
            ESP_LOGI(TAG, "index:%d, min:%.0f, max:%.0f, time:%d", i, p_data_week[i].min, p_data_week[i].max , p_data_week[i].timestamp);
        }
    }
#endif
}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static void __sensor_history_data_day_check_pa(struct sensor_data_average p_data_day[], const char *p_sensor_name, time_t now)
{
    //check history data day
    int history_hour =0;
    int cur_hour = 0;

    history_hour =p_data_day[DAY_MAX-1].timestamp/SECOND_ADJUST;
    cur_hour = now/SECOND_ADJUST;

    //ESP_LOGI(TAG, "================ now Time [%02d:%02d] ========", history_hour, cur_hour);


    for( int i =0;  i < DAY_MAX; i++) {
        if( p_data_day[i].valid) {
            ESP_LOGI(TAG, "%s index:%d, data:%.0f, time:%d", p_sensor_name, i, p_data_day[i].data, p_data_day[i].timestamp);
        }
    }

    if( history_hour  >  cur_hour) {
        ESP_LOGI(TAG, "%s History day data pull ahead, clear data", p_sensor_name);
        memset(p_data_day, 0, sizeof(struct sensor_data_average)*DAY_MAX);
        return;
    }

    for(int i =0; i < DAY_MAX-1; i++ ) {
       int hour1 =p_data_day[i].timestamp/SECOND_ADJUST;
       int hour2 =p_data_day[i+1].timestamp/SECOND_ADJUST;
       if( (hour2-hour1) != 1) {
            ESP_LOGI(TAG, "%s History day data error, clear data", p_sensor_name);
            memset(p_data_day, 0, sizeof(struct sensor_data_average)*DAY_MAX);
            return;
       }
    }

    if( history_hour == cur_hour) {
        ESP_LOGI(TAG, "%s History day data valid", p_sensor_name);
        return;
    }

    if( history_hour < ( cur_hour -(DAY_MAX-1)) ) {
        ESP_LOGI(TAG, "%s History day data expired, clear data!", p_sensor_name);
        memset(p_data_day, 0, sizeof(struct sensor_data_average)*DAY_MAX);
    } else {

        int overlap_cnt = history_hour - ( cur_hour -(DAY_MAX-1))+1;

        ESP_LOGI(TAG, "%s History day data  %d overlap !", p_sensor_name, overlap_cnt);

        for(int i =0; i < DAY_MAX; i++ ) {
            if( i < overlap_cnt) {
                p_data_day[i].data = p_data_day[DAY_MAX-overlap_cnt+i].data;
                p_data_day[i].valid = p_data_day[DAY_MAX-overlap_cnt+i].valid;
                p_data_day[i].timestamp = p_data_day[DAY_MAX-overlap_cnt+i].timestamp;
            } else {
                p_data_day[i].data = 0;
                p_data_day[i].valid = false;
                p_data_day[i].timestamp = now - ((DAY_MAX-1) -i) * SECOND_ADJUST;;
            }
        }
    }
}
static void __sensor_history_data_week_check_pa(struct sensor_data_minmax p_data_week[], const char *p_sensor_name, time_t now)
{
    //check history data week
    int history_day =0;
    int cur_day = 0;

    history_day =p_data_week[6].timestamp/ (SECOND_ADJUST * DAY_MAX);
    cur_day = now/ (SECOND_ADJUST * DAY_MAX);

    for( int i =0;  i < 7; i++) {
        if( p_data_week[i].valid) {
            ESP_LOGI(TAG, "%s, index:%d, min:%.0f, max:%.0f, time:%d", p_sensor_name, i, p_data_week[i].min, p_data_week[i].max , p_data_week[i].timestamp);
        }
    }

    if( history_day  >  cur_day){
        ESP_LOGI(TAG, "%s History week data pull ahead, clear data", p_sensor_name);
        memset(p_data_week, 0, sizeof(struct sensor_data_minmax)*7);
        return;
    }


    for(int i =0; i < 6; i++ ) {
       int  day1 =p_data_week[i].timestamp/ (SECOND_ADJUST * DAY_MAX);
       int  day2 =p_data_week[i+1].timestamp/ (SECOND_ADJUST * DAY_MAX);
       if( (day2-day1) != 1) {
            ESP_LOGI(TAG, "%s History week data error, clear data", p_sensor_name);
            memset(p_data_week, 0, sizeof(struct sensor_data_minmax)*7);
            return;
       }
    }

    if( history_day  == cur_day){
        ESP_LOGI(TAG, "%s History week data valid", p_sensor_name);
        return;
    }

    if( history_day < ( cur_day -6) ) {
        ESP_LOGI(TAG, "%s History week data expired, clear data!", p_sensor_name);
        memset(p_data_week, 0, sizeof(struct sensor_data_minmax)*7);

    } else {

        int overlap_cnt = history_day - ( cur_day -6)+1;

        ESP_LOGI(TAG, "%s History week data , %d overlap!", p_sensor_name, overlap_cnt);

        for(int i =0; i < 7; i++ ) {
            if( i < overlap_cnt) {
                p_data_week[i].max = p_data_week[7-overlap_cnt+i].max;
                p_data_week[i].min = p_data_week[7-overlap_cnt+i].min;
                p_data_week[i].timestamp = p_data_week[7-overlap_cnt+i].timestamp;
                p_data_week[i].valid = p_data_week[7-overlap_cnt+i].valid;
            } else {

                p_data_week[i].max = 0;
                p_data_week[i].min = 0;
                p_data_week[i].timestamp = now - (6 -i) * (SECOND_ADJUST * DAY_MAX);
                p_data_week[i].valid = false;
            }
        }
    }
}
static void __sensor_history_data_day_insert_pa(struct sensor_data_average p_data_day[],  struct sensor_present_data  *p_cur,  time_t now)
{
    int history_hour =0;
    int cur_hour = 0;
    struct tm timeinfo;

    localtime_r( &now, &timeinfo);
    //cur_hour = timeinfo.tm_hour;
    cur_hour = (((timeinfo.tm_hour * 60) + timeinfo.tm_min) * 60) / SECOND_ADJUST;
    
