hiroshica/SenseCAP_Indicator_ESP32/examples/indicator_basis/main/model/indicator_sensor.c
    if(p_data_day[DAY_MAX-1].valid){
        localtime_r( &(p_data_day[DAY_MAX-1].timestamp), &timeinfo);
        //history_hour = timeinfo.tm_hour;
        history_hour = (((timeinfo.tm_hour * 60) + timeinfo.tm_min) * 60) / SECOND_ADJUST;
    }


    ESP_LOGI(TAG, "================ insert PA:[h:%d::c:%d] [%02d:%02d] ================" , history_hour,cur_hour, timeinfo.tm_hour, timeinfo.tm_min);

    if( cur_hour == history_hour) {
        return;
    }

    for( int i =0;  i < DAY_MAX-1; i++) {
        p_data_day[i].data = p_data_day[i+1].data;
        p_data_day[i].valid = p_data_day[i+1].valid;
        p_data_day[i].timestamp = p_data_day[i+1].timestamp;
        
        if( !p_data_day[i].valid) {
            p_data_day[i].timestamp = now - (((DAY_MAX-1) - i) * SECOND_ADJUST);
        }
    }
    if( p_cur->per_hour_cnt >=1) {
        p_data_day[DAY_MAX-1].valid = true;
        p_data_day[DAY_MAX-1].data = p_cur->average;

        //clear present data 
        p_cur->per_hour_cnt = 0;
        p_cur->sum = 0.0;

    }  else {
        p_data_day[DAY_MAX-1].valid = false;
    }
    p_data_day[DAY_MAX-1].timestamp = now;

#if SENSOR_HISTORY_DATA_DEBUG
    for( int i =0;  i < DAY_MAX; i++) {
        if( p_data_day[i].valid) {
            ESP_LOGI(TAG, "index:%d, data:%.0f, time:%d", i, p_data_day[i].data, p_data_day[i].timestamp);
        }
    }
#endif

}
static void __sensor_history_data_week_insert_pa(struct sensor_data_minmax p_data_week[],  struct sensor_present_data  *p_cur, time_t now)
{
    int history_mday =0;
    int cur_mday = 0;
    struct tm timeinfo;

    localtime_r( &now, &timeinfo);
    cur_mday = timeinfo.tm_mday;
    
    localtime_r( &(p_data_week[6].timestamp), &timeinfo);
    history_mday= timeinfo.tm_mday;

    if( history_mday ==  cur_mday) {
        return;
    }

    for( int i =0;  i < 6; i++) {
        p_data_week[i].max = p_data_week[i+1].max;
        p_data_week[i].min = p_data_week[i+1].min;
        p_data_week[i].timestamp = p_data_week[i+1].timestamp;
        p_data_week[i].valid = p_data_week[i+1].valid;

        if( !p_data_week[i].valid) {
            p_data_week[i].timestamp = now - (6 -i) * (SECOND_ADJUST * DAY_MAX);
        }
    }
    if( p_cur->per_day_cnt >=1) {
        p_data_week[6].valid = true;
        p_data_week[6].max = p_cur->day_max;
        p_data_week[6].min = p_cur->day_min;

        //clear present data
        p_cur->day_max = 0.0;
        p_cur->day_min = 0.0;
        p_cur->per_day_cnt = 0;
    }  else {
        p_data_week[6].valid = false;
    }
    p_data_week[6].timestamp = now;

#if SENSOR_HISTORY_DATA_DEBUG
    for( int i =0;  i < 7; i++) {
        if( p_data_week[i].valid) {
            ESP_LOGI(TAG, "index:%d, min:%.0f, max:%.0f, time:%d", i, p_data_week[i].min, p_data_week[i].max , p_data_week[i].timestamp);
        }
    }
#endif
}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


static void __sensor_history_data_check(time_t now)
{
    static bool  check_flag = false;
    if(check_flag) {
        return;
    }
    check_flag =  true;

    xSemaphoreTake(__g_data_mutex, portMAX_DELAY);
    __sensor_history_data_day_check(__g_sensor_history_data.temp.data_day,   "Temp", now - SECOND_ADJUST);
    __sensor_history_data_week_check(__g_sensor_history_data.temp.data_week, "Temp",  now - SECOND_ADJUST * DAY_MAX);

    __sensor_history_data_day_check(__g_sensor_history_data.humidity.data_day,   "Humidity", now - SECOND_ADJUST);
    __sensor_history_data_week_check(__g_sensor_history_data.humidity.data_week, "Humidity",  now - SECOND_ADJUST * DAY_MAX);

    __sensor_history_data_day_check(__g_sensor_history_data.co2.data_day,   "CO2", now - SECOND_ADJUST);
    __sensor_history_data_week_check(__g_sensor_history_data.co2.data_week, "CO2",  now - SECOND_ADJUST * DAY_MAX);


    __sensor_history_data_day_check(__g_sensor_history_data.tvoc.data_day,   "TVOC", now - SECOND_ADJUST);
    __sensor_history_data_week_check(__g_sensor_history_data.tvoc.data_week, "TVOC",  now - SECOND_ADJUST * DAY_MAX);

    __sensor_history_data_day_check_pa(__g_sensor_history_data.pa.data_day,   "Atmosphere", now - SECOND_ADJUST);
    __sensor_history_data_week_check_pa(__g_sensor_history_data.pa.data_week, "Atmosphere",  now - SECOND_ADJUST * DAY_MAX);

    xSemaphoreGive(__g_data_mutex);
}

struct atmosphere_record
{
    struct sensor_data_average *atmosphere_over10_now;
    struct sensor_data_minmax *atmosphere_over10_week;
};
bool atmosphere_over10 = false;
struct atmosphere_record atmosphere_record_data;


static void __check_atmosphere(int prev_mday, int cur_hour, int cur_mday)
{
    xSemaphoreTake(__g_data_mutex, portMAX_DELAY);

    struct sensor_data_average *p_data_day = __g_sensor_history_data.pa.data_day;
    struct sensor_data_minmax *p_data_week = __g_sensor_history_data.pa.data_week;
    struct sensor_data_average *cur_data_day = NULL;
    struct sensor_data_minmax *prev_data_day_av = NULL;
    atmosphere_over10 = false;
    atmosphere_record_data.atmosphere_over10_now = NULL;
    atmosphere_record_data.atmosphere_over10_week = NULL;
    bool errflag = false;
    struct tm timeinfo = { 0 };

    ESP_LOGI(TAG, "================ Histroy index[%d:%d][%d] ================", prev_mday, cur_mday, cur_hour);
    //__cmd_send(PKT_TYPE_CMD_BEEP_ON, NULL, 0);

    for( int iI =0;  iI < DAY_MAX; iI++)
    {
        if(p_data_day[iI].valid){
           localtime_r( &p_data_day[iI].timestamp, &timeinfo);
           int calc_hour = (((timeinfo.tm_hour * 60) + timeinfo.tm_min) * 60) / SECOND_ADJUST;
           if(calc_hour == cur_hour){
                ESP_LOGI(TAG, "================ Histroy cur get [%d:%d] ================", iI, cur_hour);
                cur_data_day = &p_data_day[iI];
                continue;
           }
        }
    }
    for( int iI =0;  iI < WEEK_MAX; iI++){
        if(p_data_week[iI].valid){
            localtime_r( &(p_data_week[iI].timestamp), &timeinfo);
            if(timeinfo.tm_mday == prev_mday){
                prev_data_day_av = &p_data_week[iI];
                ESP_LOGI(TAG, "================ Histroy prev mday get [%d:%d] ================", iI,prev_mday);
            }
        }
    }

    if(cur_data_day == NULL)
    {
        ESP_LOGI(TAG, "================ Cur       Histroy Data Error!!! [%d] ================", cur_hour);
        errflag = true;
    }
    if(prev_data_day_av == NULL)
    {
        ESP_LOGI(TAG, "================ Prev mday Histroy Data Error!!! [%d] ================", prev_mday);
        errflag = true;
    }

    if(!errflag)
    {
        int elaped = abs((int)(prev_data_day_av->min - cur_data_day->data));
        if(elaped >= 10 && elaped  < 1000){
            atmosphere_over10 = true;
            atmosphere_record_data.atmosphere_over10_now = cur_data_day;
            atmosphere_record_data.atmosphere_over10_week = prev_data_day_av;
            ESP_LOGI(TAG, "================ Histroy [%4d][ true] ================", elaped);
            //esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENDMAIL, NULL, 0, portMAX_DELAY);
            __cmd_send(PKT_TYPE_CMD_BEEP_ON, NULL, 0);
        }
        else{
            ESP_LOGI(TAG, "================ Histroy [%4d][%d:%d][false] ================", elaped, (int)prev_data_day_av->min, (int)cur_data_day->data);
            //esp_event_post_to(view_event_handle, VIEW_EVENT_BASE, VIEW_EVENT_SENDMAIL, NULL, 0, portMAX_DELAY);
        }
    }
#if 0
    else{
        for( int iI =0;  iI < DAY_MAX; iI++)
        {
            if(p_data_day[iI].valid){
                localtime_r( &p_data_day[iI].timestamp, &timeinfo);
                int calc_hour = (((timeinfo.tm_hour * 60) + timeinfo.tm_min) * 60) / SECOND_ADJUST;
                ESP_LOGI(TAG, "================ Histroy dump[%3d][%d:%4d] ================", iI, calc_hour, (int)p_data_day[iI].data);
            }
            else{
                ESP_LOGI(TAG, "================ Histroy dump[%3d] not data ================", iI);
            }
        }
    }
#endif

    xSemaphoreGive(__g_data_mutex);
}

static void __sensor_history_data_day_update(time_t now)
{
    xSemaphoreTake(__g_data_mutex, portMAX_DELAY);
    
    __sensor_history_data_day_insert( __g_sensor_history_data.temp.data_day, &__g_sensor_present_data.temp, now);

    __sensor_history_data_day_insert( __g_sensor_history_data.humidity.data_day, &__g_sensor_present_data.humidity, now);

    __sensor_history_data_day_insert( __g_sensor_history_data.co2.data_day, &__g_sensor_present_data.co2, now);

    __sensor_history_data_day_insert( __g_sensor_history_data.tvoc.data_day, &__g_sensor_present_data.tvoc, now);

    __sensor_history_data_day_insert_pa( __g_sensor_history_data.pa.data_day, &__g_sensor_present_data.pa, now);

    xSemaphoreGive(__g_data_mutex);
    __sensor_history_data_save();
}

static void __sensor_history_data_week_update(time_t now)
{
    xSemaphoreTake(__g_data_mutex, portMAX_DELAY);

    __sensor_history_data_week_insert(__g_sensor_history_data.temp.data_week, &__g_sensor_present_data.temp, now);

    __sensor_history_data_week_insert(__g_sensor_history_data.humidity.data_week, &__g_sensor_present_data.humidity, now);

    __sensor_history_data_week_insert(__g_sensor_history_data.co2.data_week, &__g_sensor_present_data.co2, now);
    
    __sensor_history_data_week_insert(__g_sensor_history_data.tvoc.data_week, &__g_sensor_present_data.tvoc, now);

    __sensor_history_data_week_insert_pa(__g_sensor_history_data.pa.data_week, &__g_sensor_present_data.pa, now);

    xSemaphoreGive(__g_data_mutex);
    __sensor_history_data_save();

