hiroshica/SenseCAP_Indicator_ESP32/examples/indicator_basis/main/model/indicator_sensor.c
}

static int dummy_loop = 2;      // 時間取得が割るまでのダミーループ
static void __sensor_history_data_update_callback(void* arg)
{
    static int last_hour = DAY_MAX+1;
    static int last_day  = 32;
    static time_t  last_timestamp1 = 0;
    static time_t  last_timestamp2 = 0;
    time_t now = 0;

    now = time(NULL);

    //  todo test
    // static int time_cnt = 1;
    // now += time_cnt * 3600;
    // time_cnt++;

    struct tm timeinfo = { 0 };
    localtime_r( &now, &timeinfo);

    char strftime_buf[64];
    strftime(strftime_buf, sizeof(strftime_buf), "%c", &timeinfo);

    //int cur_hour = timeinfo.tm_hour;
    int cur_hour = (((timeinfo.tm_hour * 60) + timeinfo.tm_min) * 60) / SECOND_ADJUST;
    int cur_day  = timeinfo.tm_mday;

    ESP_LOGI(TAG, "__sensor_history_data_update_callback: %s[%d:%d][%02d:%02d]", strftime_buf, cur_hour, last_hour, timeinfo.tm_hour,timeinfo.tm_min);

    //if greater than 2020 year mean time is right 
    if( timeinfo.tm_year  < 120) { 
        ESP_LOGI(TAG, "The time is not right!!!");
        return;
    }

    __sensor_history_data_check( now);

    if(dummy_loop != 0){
        dummy_loop--;
        return;
    }

    // Hour change and the duration is greater than 1 hour (to prevent hour change during time zone synchronization) 
    // 小时变化并且 时长大于1h （防止在时区同步时, 小时变化的情况）
    // SECOND_ADJUST分単位でupdateする
    if( cur_hour != last_hour  &&  ((now - last_timestamp1) > SECOND_ADJUST) ) {

        last_hour = cur_hour;
        
        if( last_timestamp1 == 0) {
            last_timestamp1 = ((now - SECOND_ADJUST)/SECOND_ADJUST) * SECOND_ADJUST;
        }
        ESP_LOGI(TAG, "__sensor_history_data_update_callback: day update [lasttimestamp1:%d] ", last_timestamp1);
       
        struct updata_queue_msg msg = {
            .flag = 1,
            .time = last_timestamp1,
        };

        xQueueSendFromISR(updata_queue_handle, &msg, NULL);
        //__sensor_history_data_day_update(last_timestamp1);

        last_timestamp1 = ((now)/SECOND_ADJUST) * SECOND_ADJUST; // Sample at the hour        
    }

    // week update check
    if( cur_day != last_day  &&  ((now - last_timestamp2) > (SECOND_ADJUST*DAY_MAX))) {
        last_day = cur_day;
        ESP_LOGI(TAG, "__sensor_history_data_update_callback: week update [lasttimestamp2:%d] ", last_timestamp2);

        if( last_timestamp2 == 0) {
            last_timestamp2 = ((now - SECOND_ADJUST * DAY_MAX) / (SECOND_ADJUST * DAY_MAX)) * (SECOND_ADJUST * DAY_MAX);
        }

        struct updata_queue_msg msg = {
            .flag = 2,
            .time = last_timestamp2,
        };

        xQueueSendFromISR(updata_queue_handle, &msg, NULL);

        //__sensor_history_data_week_update(last_timestamp2);
        
        last_timestamp2 = ((now) / (SECOND_ADJUST * DAY_MAX)) * (SECOND_ADJUST * DAY_MAX); //Sample at the day
    }
}

static __sensor_history_data_update_init(void)
{
    const esp_timer_create_args_t timer_args = {
            .callback = &__sensor_history_data_update_callback,
            /* argument specified here will be passed to timer callback function */
            .arg = (void*) sensor_history_data_timer_handle,
            .name = "sensor data update"
    };
    ESP_ERROR_CHECK( esp_timer_create(&timer_args, &sensor_history_data_timer_handle));
    ESP_ERROR_CHECK(esp_timer_start_periodic(sensor_history_data_timer_handle, 1000000 * 10)); //10s

}

static void sensor_history_data_updata_task(void *arg)
{
    struct updata_queue_msg msg = {};
    while(1) {
        if(xQueueReceive(updata_queue_handle, &msg, portMAX_DELAY)) {
            int check_atomosf = 0;
            if( msg.flag == 1) {
                ESP_LOGI(TAG, "update day history data");
                __sensor_history_data_day_update(msg.time);
                check_atomosf++;
            } else if( msg.flag == 2) {
                ESP_LOGI(TAG, "update week history data");
                __sensor_history_data_week_update(msg.time);
                check_atomosf++;
            }
            if(check_atomosf != 0){
                time_t now = msg.time;
                struct tm timeinfo = { 0 };
                localtime_r( &now, &timeinfo);
                int cur_hour = (((timeinfo.tm_hour * 60) + timeinfo.tm_min) * 60) / SECOND_ADJUST;
                int cur_mday = timeinfo.tm_mday;
                time_t pnow = now - (60*60*24); // minus 1day
                localtime_r( &pnow, &timeinfo);
                int prev_mday = timeinfo.tm_mday;

                __check_atmosphere(prev_mday,cur_hour,cur_mday);
            }
        }

    }
}

static void __sensor_history_data_restore(void)
{
    esp_err_t ret = 0;

    size_t len = sizeof(__g_sensor_history_data);
    
    ret = indicator_storage_read(SENSOR_HISTORY_DATA_STORAGE, (void *)&__g_sensor_history_data, &len);
    if( ret == ESP_OK  && len== (sizeof(__g_sensor_history_data)) ) {
        ESP_LOGI(TAG, "sensor history data read successful");
    } else {
        // err or not find
        if( ret == ESP_ERR_NVS_NOT_FOUND) {
            ESP_LOGI(TAG, "sensor history data not find");
        } else {
            ESP_LOGI(TAG, "sensor history data read err:%d", ret);
        }
        memset(&__g_sensor_history_data, 0 ,sizeof(__g_sensor_history_data));
    }
}

// data record
static void __sensor_present_data_update(struct sensor_present_data *p_data, float vaule)
{
    xSemaphoreTake(__g_data_mutex, portMAX_DELAY);
    p_data->per_hour_cnt++;
    p_data->sum += vaule;
    p_data->average = p_data->sum / p_data->per_hour_cnt;


    p_data->per_day_cnt++;
    if( p_data->per_day_cnt != 1) {
        if( p_data->day_min > vaule) {
            p_data->day_min = vaule;
        }
        if( p_data->day_max < vaule) {
            p_data->day_max = vaule;
        }
    } else {
        p_data->day_min = vaule;
        p_data->day_max = vaule;
    }
    xSemaphoreGive(__g_data_mutex);
}
// data record
static void __sensor_present_data_update_pa(struct sensor_present_data *p_data, float vaule)
{
    xSemaphoreTake(__g_data_mutex, portMAX_DELAY);
    p_data->per_hour_cnt++;
    p_data->sum += vaule;
    p_data->average = p_data->sum / p_data->per_hour_cnt;


    p_data->per_day_cnt++;
    if( p_data->per_day_cnt != 1) {
        if( p_data->day_min > vaule) {
            p_data->day_min = vaule;
        }
        if( p_data->day_max < vaule) {
            p_data->day_max = vaule;
        }
    } else {
        p_data->day_min = vaule;
        p_data->day_max = vaule;
    }
    //ESP_LOGI(TAG, "================ update PA:%d(min:%d max:%d) ================" ,p_data->per_day_cnt, (int)p_data->day_min, (int)p_data->day_max);

    xSemaphoreGive(__g_data_mutex);
}

static int __data_parse_handle(uint8_t *p_data, ssize_t len)
{
    uint8_t pkt_type = p_data[0];
    switch ( pkt_type)
    {
        case PKT_TYPE_SENSOR_SCD41_CO2: {
            struct view_data_sensor_data data;
            if( len < (sizeof(data.vaule) +1)) {
                break;
            }
    
            data.sensor_type = SENSOR_DATA_CO2;
            memcpy(&data.vaule, &p_data[1], sizeof(data.vaule));
            __sensor_present_data_update(&__g_sensor_present_data.co2, data.vaule);

